INSERT IGNORE INTO tb_iam_role(`id`, `sort_id`, `identifier`, `name`, `description`, `active`, `bind_check`) VALUE
(20001, 20001, 'super_admin', '超级管理员', '具备user:bind:super_admin权限才能为用户绑定此角色', 1, 1);


INSERT IGNORE INTO tb_iam_role_permission(`role_id`, `permission_id`) VALUE
-- 菜单/路由权限 --
(20001, 20001),
(20001, 20002),
(20001, 20003),
(20001, 20004),
(20001, 20101),
(20001, 20102),
(20001, 20103),
(20001, 20104),
(20001, 20105),
(20001, 20106),
-- 权限 --
(20001, 21001),
(20001, 21002),
(20001, 21003),
(20001, 21004),
-- 角色 --
(20001, 22001),
(20001, 22002),
(20001, 22003),
(20001, 22004),
(20001, 22005),
-- 用户 --
(20001, 23001),
(20001, 23002),
(20001, 23003),
(20001, 23004),
(20001, 23005),
(20001, 23006),
-- 接口 --
(20001, 11001),
(20001, 11002),
(20001, 11003),
(20001, 11004),
-- 路径 --
(20001, 10001),
(20001, 10002),
(20001, 10003),
(20001, 10004),
-- 菜单
(20001, 12001),
(20001, 12002),
(20001, 12003),
(20001, 12004);


-- ##### User ##### --
INSERT IGNORE INTO tb_iam_user(`id`, `username`, `password`, `salt`, `register_time`, `active`, `is_delete`) VALUE
-- superadmin / superadmin
(20001, 'superadmin', '8176126c91f53981449d7575bafa1103', '6386718be1b3', '2010-01-01 00:00:00', 1, 0);
INSERT IGNORE INTO tb_iam_user_role(`user_id`, `role_id`) VALUE
-- superadmin
(20001, 20001);
